Revit 2024 API
IFCImportOptions.AutocorrectOffAxisLines Property
 Enable or disable correcting lines that are slight off-axis.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool AutocorrectOffAxisLines { get; set; }
Visual Basic
Public Property AutocorrectOffAxisLines As Boolean
	Get
	Set
Visual C++
public:
property bool AutocorrectOffAxisLines {
	bool get ();
	void set (bool value);
}
Remarks
 Enabling correcting lines that are slightly off-axis will snap lines that are close to axes to the nearest axis. This will reduce warnings in Revit, but may cause elements that are created from sketches to slightly change shape, and extrusions to slightly change directions. Disabling this option will leave the original geometry intact but may cause warnings in Revit. Default is true for Open IFC; it is ignored (and false) for Link IFC.
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace